### CHAPTER 7
# Data Cleaning and Preparation

In [192]:
import pandas as pd
import numpy as np

In [193]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [194]:
float_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [195]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [196]:
string_data.isnull()

0    False
1     True
2     True
3    False
dtype: bool

In [197]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [198]:
float_data.isnull()

0    False
1    False
2     True
dtype: bool

In [199]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [200]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [201]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [202]:
data.dropna()  # Drops any row with NaN values

     0    1    2
0  1.0  6.5  3.0

In [203]:
data.dropna(how='all')  # Drops any row with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [204]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [205]:
data.dropna(axis="columns", how='all')  # Drops any column with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [206]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0  0.814056  0.042235  0.759533
1  1.417799 -0.627430  0.932203
2  0.703296 -0.700158  0.233801
3 -0.713472  0.598446  0.119701
4 -0.077850  1.087527 -0.135161
5 -0.344773 -0.333332 -0.205075
6 -0.789541  2.220655 -0.755379

In [207]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  0.814056       NaN       NaN
1  1.417799       NaN       NaN
2  0.703296       NaN  0.233801
3 -0.713472       NaN  0.119701
4 -0.077850  1.087527 -0.135161
5 -0.344773 -0.333332 -0.205075
6 -0.789541  2.220655 -0.755379

In [208]:
df.dropna()

          0         1         2
4 -0.077850  1.087527 -0.135161
5 -0.344773 -0.333332 -0.205075
6 -0.789541  2.220655 -0.755379

In [209]:
df.dropna(thresh=2)  # Keep only rows with at least 2 non-NaN values

          0         1         2
2  0.703296       NaN  0.233801
3 -0.713472       NaN  0.119701
4 -0.077850  1.087527 -0.135161
5 -0.344773 -0.333332 -0.205075
6 -0.789541  2.220655 -0.755379

### Filling In Missing Data

In [210]:
df.fillna(0)  # Fill NaN values with 0

          0         1         2
0  0.814056  0.000000  0.000000
1  1.417799  0.000000  0.000000
2  0.703296  0.000000  0.233801
3 -0.713472  0.000000  0.119701
4 -0.077850  1.087527 -0.135161
5 -0.344773 -0.333332 -0.205075
6 -0.789541  2.220655 -0.755379

In [211]:
df.fillna({1:0.5, 2:0})  # Fill NaN values in column 1 with 0.5 and column 2 with 0

          0         1         2
0  0.814056  0.500000  0.000000
1  1.417799  0.500000  0.000000
2  0.703296  0.500000  0.233801
3 -0.713472  0.500000  0.119701
4 -0.077850  1.087527 -0.135161
5 -0.344773 -0.333332 -0.205075
6 -0.789541  2.220655 -0.755379

In [212]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0 -0.511662  0.150656  0.069131
1 -0.101381  1.847011  0.102307
2 -1.236280       NaN -0.462342
3  0.560866       NaN -0.245528
4  0.727958       NaN       NaN
5 -1.048169       NaN       NaN

In [213]:
df.fillna(method='ffill')  # Forward fill NaN values

C:\Users\sahor\AppData\Local\Temp\ipykernel_3528\2883871002.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')  # Forward fill NaN values

          0         1         2
0 -0.511662  0.150656  0.069131
1 -0.101381  1.847011  0.102307
2 -1.236280  1.847011 -0.462342
3  0.560866  1.847011 -0.245528
4  0.727958  1.847011 -0.245528
5 -1.048169  1.847011 -0.245528

In [214]:
df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

C:\Users\sahor\AppData\Local\Temp\ipykernel_3528\3537515366.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

          0         1         2
0 -0.511662  0.150656  0.069131
1 -0.101381  1.847011  0.102307
2 -1.236280  1.847011 -0.462342
3  0.560866  1.847011 -0.245528
4  0.727958       NaN -0.245528
5 -1.048169       NaN -0.245528

In [215]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [216]:
data.fillna(data.mean())  # Fill NaN values with the mean of the Series

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64